import sys
import time

from app.shared.runtime.logger import node_log
from app.rag.query.rerank_service import rerank_documents
from app.shared.utils.task_utils import add_done_task, add_running_task

@node_log("node_rerank")
def node_rerank(state):
    """
    节点功能：使用 Cross-Encoder 模型对 RRF 后的结果进行精确打分重排。
    """
    add_running_task(state["session_id"], sys._getframe().f_code.co_name, state.get("is_stream"))
    state = rerank_documents(state)
    time.sleep(3)
    add_done_task(state['session_id'], sys._getframe().f_code.co_name, state.get("is_stream"))
    return state

if __name__ == "__main__":
    mock_rrf_chunks = [
        {"chunk_id": "local_1", "content": "RRF是一种倒数排名融合算法", "title": "算法介绍"},
        {"chunk_id": "local_2", "content": "BGE是一个强大的重排序模型", "title": "模型介绍"},
    ]
    mock_web_docs = [
        {"title": "Rerank技术详解", "url": "http://web.com/1", "content": "Rerank即重排序，常用于RAG系统的第二阶段"},
        {"title": "Rerank技术详解2", "url": "http://web.com/1", "content": "Rerank即重排序，把巴巴爸爸吧哈哈哈哈阿萨德几哈四大行档卡户手打阿看见啊圣诞节卡仕达酱卡莎打卡手打空间哈时间跨度哈数据库等哈手机卡等哈双打卡双打卡拉哈可拉伸登记卡和大家上课啦很大手机卡老大哈萨就开了等哈时间跨度拍哈山哈哈哈哈阿萨德几哈四大行档卡户手打阿看见啊圣诞节卡仕达酱卡莎打卡手打空间哈时间跨度哈数据库等哈手哈哈哈哈阿萨德几哈四大行档卡户手打阿看见啊圣诞节卡仕达酱卡莎打卡手打空间哈时间跨度哈数据库等哈手哈哈哈哈阿萨德几哈四大行档卡户手打阿看见啊圣诞节卡仕达酱卡莎打卡手打空间哈时间跨度哈数据库等哈手哈哈哈哈阿萨德几哈四大行档卡户手打阿看见啊圣诞节卡仕达酱卡莎打卡手打空间哈时间跨度哈数据库等哈手哈哈哈哈阿萨德几哈四大行档卡户手打阿看见啊圣诞节卡仕达酱卡莎打卡手打空间哈时间跨度哈数据库等哈手哈哈哈哈阿萨德几哈四大行档卡户手打阿看见啊圣诞节卡仕达酱卡莎打卡手打空间哈时间跨度哈数据库等哈手哈哈哈哈阿萨德几哈四大行档卡户手打阿看见啊圣诞节卡仕达酱卡莎打卡手打空间哈时间跨度哈数据库等哈手哈哈哈哈阿萨德几哈四大行档卡户手打阿看见啊圣诞节卡仕达酱卡莎打卡手打空间哈时间跨度哈数据库等哈手哈哈哈哈阿萨德几哈四大行档卡户手打阿看见啊圣诞节卡仕达酱卡莎打卡手打空间哈时间跨度哈数据库等哈手哈哈哈哈阿萨德几哈四大行档卡户手打阿看见啊圣诞节卡仕达酱卡莎打卡手打空间哈时间跨度哈数据库等哈手哈哈哈哈阿萨德几哈四大行档卡户手打阿看见啊圣诞节卡仕达酱卡莎打卡手打空间哈时间跨度哈数据库等哈手哈哈哈哈阿萨德几哈四大行档卡户手打阿看见啊圣诞节卡仕达酱卡莎打卡手打空间哈时间跨度哈数据库等哈手卡拉大沙发考拉三大护法考拉大沙发你啦手机卡代发很大刷卡红烧鸡块浪费hsdjklfhsdljkfhdsjklfhdsjklfhdsfhjklsdfhjdskjfhdsjklfhdsjklfshjk常用于RAG系统的第二阶段"},
        {"title": "Rerank技术详解3", "url": "http://web.com/1", "content": "Rerank即重排序，把巴巴爸爸吧哈哈哈哈阿萨德几哈四大行档卡户手打阿看见啊圣诞节卡仕达酱卡莎打卡手打空间哈时间跨度哈数据库等哈手机卡等哈双打卡双打卡拉哈可拉伸登记卡和大家上课啦很大手机卡老大哈萨就开了等哈时间跨度拍哈山哈哈哈哈阿萨德几哈四大行档卡户手打阿看见啊圣诞节卡仕达酱卡莎打卡手打空间哈时间跨度哈数据库等哈手哈哈哈哈阿萨德几哈四大行档卡户手打阿看见啊圣诞节卡仕达酱卡莎打卡手打空间哈时间跨度哈数据库等哈手哈哈哈哈阿萨德几哈四大行档卡户手打阿看见啊圣诞节卡仕达酱卡莎打卡手打空间哈时间跨度哈数据库等哈手哈哈哈哈阿萨德几哈四大行档卡户手打阿看见啊圣诞节卡仕达酱卡莎打卡手打空间哈时间跨度哈数据库等哈手哈哈哈哈阿萨德几哈四大行档卡户手打阿看见啊圣诞节卡仕达酱卡莎打卡手打空间哈时间跨度哈数据库等哈手哈哈哈哈阿萨德几哈四大行档卡户手打阿看见啊圣诞节卡仕达酱卡莎打卡手打空间哈时间跨度哈数据库等哈手哈哈哈哈阿萨德几哈四大行档卡户手打阿看见啊圣诞节卡仕达酱卡莎打卡手打空间哈时间跨度哈数据库等哈手哈哈哈哈阿萨德几哈四大行档卡户手打阿看见啊圣诞节卡仕达酱卡莎打卡手打空间哈时间跨度哈数据库等哈手哈哈哈哈阿萨德几哈四大行档卡户手打阿看见啊圣诞节卡仕达酱卡莎打卡手打空间哈时间跨度哈数据库等哈手哈哈哈哈阿萨德几哈四大行档卡户手打阿看见啊圣诞节卡仕达酱卡莎打卡手打空间哈时间跨度哈数据库等哈手哈哈哈哈阿萨德几哈四大行档卡户手打阿看见啊圣诞节卡仕达酱卡莎打卡手打空间哈时间跨度哈数据库等哈手哈哈哈哈阿萨德几哈四大行档卡户手打阿看见啊圣诞节卡仕达酱卡莎打卡手打空间哈时间跨度哈数据库等哈手卡拉大沙发考拉三大护法考拉大沙发你啦手机卡代发很大刷卡红烧鸡块浪费hsdjklfhsdljkfhdsjklfhdsjklfhdsfhjklsdfhjdskjfhdsjklfhdsjklfshjk常用于RAG系统的第二阶段"},
        {"title": "Rerank技术详解4", "url": "http://web.com/1", "content": "Rerank即重排序，把巴巴爸爸吧哈哈哈哈阿萨德几哈四大行档卡户手打阿看见啊圣诞节卡仕达酱卡莎打卡手打空间哈时间跨度哈数据库等哈手机卡等哈双打卡双打卡拉哈可拉伸登记卡和大家上课啦很大手机卡老大哈萨就开了等哈时间跨度拍哈山哈哈哈哈阿萨德几哈四大行档卡户手打阿看见啊圣诞节卡仕达酱卡莎打卡手打空间哈时间跨度哈数据库等哈手哈哈哈哈阿萨德几哈四大行档卡户手打阿看见啊圣诞节卡仕达酱卡莎打卡手打空间哈时间跨度哈数据库等哈手哈哈哈哈阿萨德几哈四大行档卡户手打阿看见啊圣诞节卡仕达酱卡莎打卡手打空间哈时间跨度哈数据库等哈手哈哈哈哈阿萨德几哈四大行档卡户手打阿看见啊圣诞节卡仕达酱卡莎打卡手打空间哈时间跨度哈数据库等哈手哈哈哈哈阿萨德几哈四大行档卡户手打阿看见啊圣诞节卡仕达酱卡莎打卡手打空间哈时间跨度哈数据库等哈手哈哈哈哈阿萨德几哈四大行档卡户手打阿看见啊圣诞节卡仕达酱卡莎打卡手打空间哈时间跨度哈数据库等哈手哈哈哈哈阿萨德几哈四大行档卡户手打阿看见啊圣诞节卡仕达酱卡莎打卡手打空间哈时间跨度哈数据库等哈手哈哈哈哈阿萨德几哈四大行档卡户手打阿看见啊圣诞节卡仕达酱卡莎打卡手打空间哈时间跨度哈数据库等哈手哈哈哈哈阿萨德几哈四大行档卡户手打阿看见啊圣诞节卡仕达酱卡莎打卡手打空间哈时间跨度哈数据库等哈手哈哈哈哈阿萨德几哈四大行档卡户手打阿看见啊圣诞节卡仕达酱卡莎打卡手打空间哈时间跨度哈数据库等哈手哈哈哈哈阿萨德几哈四大行档卡户手打阿看见啊圣诞节卡仕达酱卡莎打卡手打空间哈时间跨度哈数据库等哈手哈哈哈哈阿萨德几哈四大行档卡户手打阿看见啊圣诞节卡仕达酱卡莎打卡手打空间哈时间跨度哈数据库等哈手卡拉大沙发考拉三大护法考拉大沙发你啦手机卡代发很大刷卡红烧鸡块浪费hsdjklfhsdljkfhdsjklfhdsjklfhdsfhjklsdfhjdskjfhdsjklfhdsjklfshjk常用于RAG系统的第二阶段"},
    ]
    mock_state = {
        "session_id": "test_rerank_session",
        "rewritten_query": "什么是RRF和Rerank？",
        "rrf_chunks": mock_rrf_chunks,
        "web_search_docs": mock_web_docs,
        "is_stream": False,
    }
    result = node_rerank(mock_state)
    print(result)